## `terraform/keeping`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Read complete after 0s [id=34d55e91682b29a9c65529178b71ea86f6a6a99b]
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Reading...
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Read complete after 0s [id=42213ff4be793356631c8e7788749fa7d39a9d85]
module.custom_iam.aws_iam_role.main_ecs_tasks: Refreshing state... [id=ecs_tasks-minecraft-test-role]
module.custom_iam_role_for_github.aws_iam_policy.github_actions: Refreshing state... [id=arn:aws:iam::528163014577:policy/minecraft-test-github-actions]
module.custom_iam.aws_iam_policy.chatbot-notification-only: Refreshing state... [id=arn:aws:iam::528163014577:policy/chatbot-notification-only]
module.custom_iam.aws_iam_role.task_execution_role: Refreshing state... [id=minecraft-test-ecs_tasks_execution-role]
module.custom_iam.aws_iam_role.chatbot-notification-only: Refreshing state... [id=chatbot-notification-only]
module.custom_iam_role_for_github.aws_iam_role.github_actions: Refreshing state... [id=minecraft-test-github-actions]
module.custom_vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0270b1cdcb23a7135]
module.custom_iam_role_for_github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::528163014577:oidc-provider/token.actions.githubusercontent.com]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Reading...
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Read complete after 0s [id=3154560550]
module.custom_sns.aws_kms_key.for_encrypt_sns_topic: Refreshing state... [id=3c5fe741-0d48-4232-8734-b9fa00af7b65]
module.custom_iam_role_for_github.aws_iam_role_policy_attachment.github_actions: Refreshing state... [id=minecraft-test-github-actions-20231101102449900000000001]
module.custom_iam.aws_iam_role_policy_attachment.chatbot-notification-only-attach: Refreshing state... [id=chatbot-notification-only-20231101102449909500000002]
module.custom_iam.aws_iam_role_policy.execution_policy: Refreshing state... [id=minecraft-test-ecs_tasks_execution-role:minecraft-test-task-execution-policy]
module.custom_iam.aws_iam_role_policy.ExecuteCommand: Refreshing state... [id=ecs_tasks-minecraft-test-role:minecraft-test-ExecuteCommand]
module.custom_iam.aws_iam_role_policy.firelensPolicy: Refreshing state... [id=ecs_tasks-minecraft-test-role:minecraft-test-firelensPolicy]
module.custom_sns.aws_sns_topic.main: Refreshing state... [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_sns.aws_sns_topic_subscription.main: Refreshing state... [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic:2f92330f-485e-4855-8ef2-39dc603cdc6e]
module.custom_chatbot.module.chatbot_slack_configuration.aws_cloudformation_stack.chatbot_slack_configuration: Refreshing state... [id=arn:aws:cloudformation:ap-northeast-1:528163014577:stack/chatbot-slack-configuration-minecraft-test-chatbot/e7cebc10-78a0-11ee-8de8-0e0a6af253d9]
null_resource.name: Refreshing state... [id=1427738649012576209]
module.custom_vpc.module.fargate_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0ff774e5d9c25fc86]
module.custom_vpc.module.allow_nfs_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0f1a1bbf9d07100c6]
module.custom_vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0eb46686231acfe01]
module.custom_vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d427f333f0439c73]
module.custom_vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0eda7e30ee1c82d65]
module.custom_vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0595d66ac76156546]
module.custom_vpc.module.allow_nfs_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2095438470]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-898243753]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-1723677096]
module.custom_vpc.module.allow_nfs_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1274416454]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-4165509456]
module.custom_vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0455b9e55e29f39a1]
module.custom_vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a69e64145352a2db]
module.custom_vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0595d66ac761565461080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.custom_sns.aws_kms_alias.for_encrypt_sns_topic_alias will be created
  + resource "aws_kms_alias" "for_encrypt_sns_topic_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cwa/for_encrypt_sns_topic"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "3c5fe741-0d48-4232-8734-b9fa00af7b65"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../modules/github/openid_connect_provider.tf line 6, in data "tls_certificate" "github_actions":
   6:   url = jsondecode(data.http.github_actions_openid_configuration.body).jwks_uri

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>